---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ConnectorFailures.InvalidPowerFactorValue
source: html/ca2b9e3a-898a-7650-becc-3591f62b608f.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ConnectorFailures.InvalidPowerFactorValue Property

The value for Power Factor must be between 0 and 1.

## Syntax (C#)
```csharp
public static FailureDefinitionId InvalidPowerFactorValue { get; }
```